Repository: chuymaster/thaivtuberranking-frontend
Catalog: lib/l10n/app_*.arb
Languages: ja, th

# app__site_title
source: Thai VTubers (Virtual Youtubers) Directory
ja: タイのVTuber（バーチャルユーチューバー）一覧
th: ลิสต์รายชื่อ VTuber (วีทูปเบอร์) ไทย

# common_type_full_vtuber
source: Original VTuber
ja: オリジナルVTuber
th: VTuber เต็มตัว

# common_type_all_vtuber
source: All VTuber
ja: 全てのVTuber
th: VTuber ทั้งหมด

# navigation_menu_info_last_updated_at
source: Last updated: {lastUpdatedAt}
ja: 最終更新日 {lastUpdatedAt}
th: ข้อมูลอัปเดต {lastUpdatedAt}

# navigation_menu_info_site_description
source: Find your favorite Thai VTubers!
ja: お気に入りのタイのVTuberを見つけよう！
th: เว็บนี้จัดทำเพื่อส่งเสริมวงการ VTuber ไทย โดยการเรียบเรียงแชนแนล VTuber คนไทยบนยูทูป

# navigation_menu_menu_title
source: Menu
ja: メニュー
th: เมนู

# navigation_menu_menu_add_new_channel
source: Submit new channel
ja: チャンネル掲載申請
th: แจ้งเพิ่มแชนแนล

# navigation_menu_menu_report_problems
source: Report Problems / Suggest Features
ja: お問い合わせ・要望
th: แจ้งปัญหา/แจ้งข้อมูลแชนแนลผิด/เสนอฟีเจอร์

# navigation_menu_menu_deletion_criterias
source: Automatic Channel Deletion Criterias
ja: チャンネル自動削除基準
th: เกณฑ์การลบแชนแนลโดยอัตโนมัติ

# navigation_menu_menu_disclaimer
source: Disclaimer
ja: 免責事項
th: คำสงวนสิทธิ์

# navigation_menu_menu_discover_thai_vtuber
source: Discover Thai VTubers Info
ja: タイのVTuber情報を探す
th: แหล่งข้อมูล VTuber ไทย

# navigation_menu_menu_for_developers
source: For Developers
ja: 開発者向け情報
th: ข้อมูลสำหรับนักพัฒนา

# navigation_menu_menu_api_document
source: API Document
ja: APIドキュメント

# navigation_menu_menu_client_app_repo
source: Client App Repository
ja: クライアントアプリレポジトリ

# navigation_menu_menu_release_notes
source: Release Notes
ja: リリースノート

# navigation_menu_menu_developer_blog
source: Developer Blog
ja: 作者ブログ
th: บล็อกผู้พัฒนา

# announcement_text_delete_channel
source: Announcement regarding channel delete
ja: チャンネル削除告知
th: ประกาศเรื่องการลบแชนแนล

# common_alert_error
source: Error
ja: エラー

# common_button_close
source: Close
ja: 閉じる
th: ปิด

# banner_text_reality
source: REALITY - Become an Anime Avatar
ja: REALITY - 顔出しナシのライブ配信

# banner_description_reality
source: Transform yourself and live like a VTuber!
ja: スマホ一台で好きな姿に変身！
th: สร้างอวาตาร์อนิเมะมาไลฟ์แบบ VTuber เลย!

# common_button_reload
source: Reload
ja: 再読込
th: รีโหลด

# channel_button_copy_url
source: Copy the URL of this page
ja: このページのURLをコピー
th: Copy URL ของหน้านี้

# channel_toast_copied_url
source: Copied URL
ja: コピーしました
th: Copy URL แล้ว

# channel_graph_description
source: Graph
ja: グラフ
th: กราฟความเปลี่ยนแปลง

# channel_description_empty
source: No description
ja: チャンネル説明なし
th: ไม่มีคำอธิบาย

# channel_info_subscribers_views
source: Subscribers: {subscribers} Views: {views}
ja: 登録者{subscribers}人 再生{views}回
th: ผู้ติดตาม {subscribers} คน ดู {views} ครั้ง

# channel_info_updated_published
source: Latest video: {updated} Channel published: {published}
ja: 最新動画 {updated} チャンネル開設日 {published}
th: คลิปล่าสุด {updated} วันเปิดแชนแนล {published}

# channel_registration_complete_text_title
source: Channel submitted
ja: チャンネル掲載申請が完了しました。
th: แจ้งเพิ่มแชนแนลสำเร็จ

# channel_registration_complete_text_description
source: Thank you for submitting the channel. We will add it to the channel database after verification.
ja: ご申請いただき、ありがとうございます。 確認後、問題なければチャンネル一覧に掲載いたします。
th: ขอบคุณที่ส่งข้อมูลแชนแนล ทางทีมงานจะพิจารณาและนำเข้าสู่ฐานข้อมูลหากข้อมูลถูกต้อง

# channel_registration_complete_button_home
source: Back to home
ja: ホームに戻る
th: กลับสู่หน้าแรก

# channel_registration_text_title
source: Submit new VTuber channel
ja: VTuberチャンネル掲載申請
th: แจ้งเพิ่มแชนแนล VTuber

# channel_registration_text_input_channel
source: Enter the channel ID, started with UC
ja: UCで始まるチャンネルIDを入力してください。
th: โปรดกรอกแชนแนล ID (ขึ้นต้นด้วย UC)

# channel_registration_text_select_channel_type
source: Select the channel type
ja: チャンネルカテゴリの選択
th: โปรดเลือกประเภทของช่องที่ต้องการแจ้ง

# channel_registration_text_check_before_submit
source: Please check the channel info again before submitting.
ja: チャンネル情報が正しいかどうか、今一度ご確認ください。
th: โปรดตรวจสอบแชนแนลอีกครั้งก่อนส่งข้อมูล

# channel_registration_button_submit
source: Submit
ja: 申請
th: ส่งข้อมูล

# channel_registration_error_id_required
source: Enter channel ID
ja: チャンネルIDを入力してください。
th: โปรดกรอกแชนแนล ID

# channel_registration_error_not_begin_with_uc
source: Channel ID must start with UC
ja: チャンネルIDはUCで始まる必要があります。
th: แชนแนล ID ต้องขึ้นต้นด้วย UC

# channel_registration_error_length_mismatched
source: Channel ID must be {channelIdLength} characters long
ja: チャンネルIDは{channelIdLength}文字である必要があります。
th: แชนแนล ID ต้องมีความยาว {channelIdLength} ตัวอักษร

# channel_registration_error_already_existed
source: This channel is already in the database
ja: このチャンネルは掲載済です。
th: แชนแนลนี้อยู่ในฐานข้อมูลแล้ว

# channel_registration_error_unknown
source: There was a problem submitting data, please try again later
ja: 問題が発生しました。後ほど再試行してください。
th: เกิดปัญหาในการส่งข้อมูล กรุณาลองใหม่ในภายหลัง

# channel_registration_title_id_explanation
source: What is a Channel ID?
ja: チャンネルIDとは？
th: แชนแนล ID คืออะไร?

# channel_registration_title_type_explanation
source: Types of channels allowed:
ja: 掲載可能なチャンネル
th: ประเภทของแชนแนลที่อนุญาต

# channel_registration_text_full_vtuber_explanation
source: - Channels primarily featuring VTuber models (Live2D or 3D) from the first content and having a VTuber model as the main character of the content
ja: ・チャンネル開設時からVTuberモデル（Live2Dまたは3D）を使って動画を投稿し、主にVTuberとして活動しているチャンネル
th: - แชนแนลที่นำแสดงโดยโมเดล VTuber (โมเดล Live2D หรือ 3D) เป็นหลักตั้งแต่คอนเทนต์แรก มีโมเดล VTuber เป็นตัวเอกของคอนเทนต์ และประกาศตนว่าเป็น VTuber

# channel_registration_text_all_vtuber_explanation
source: - Channels that primarily feature VTuber models after having other contents for a period of time. These channels will only appear in the 'All VTubers' category.
ja: ・一定期間の活動後、VTuberに転換したチャンネル。あるいはVTuberモデルを使って動画を投稿していますが、メインコンテンツではないチャンネル。「全てのVTuber」のカテゴリで表示されます。
th: - แชนแนลที่นำโมเดล VTuber มาแสดงเป็นหลักหลังจากเปิดแชนแนลและอัพโหลดคอนเทนต์อื่นไปแล้ว จะปรากฏในการรายชื่อหมวด "VTuber ทั้งหมด" เท่านั้น

# channel_registration_text_type_explanation
source: In both cases, the channels must be created by Thais, primarily targeting Thai audiences, and have uploaded some contents.
ja: いずれもタイ人によって制作され、タイ人を主な視聴者としている、かつコンテンツがアップロードされている場合に限り、掲載が可能になります。
th: ทั้งสองกรณีต้องเป็นแชนแนลที่ทำโดยคนไทย มุ่งเน้นกลุ่มผู้ชมคนไทยเป็นหลัก และมีคอนเทนต์อัพโหลดแล้ว ทีมงานจึงจะสามารถพิจารณาได้

# channel_registration_text_id_explanation_1
source: Channel ID is the code following the URL of the channel, such as https://www.youtube.com/channel/
ja: チャンネルIDは、チャンネルURLに続くコードです。例：https://www.youtube.com/channel/
th: แชนแนล ID คือรหัสตามหลัง URL ของแชนแนล เช่น https://www.youtube.com/channel/

# channel_registration_text_id_explanation_2
source: You can check the channel ID from this site.
ja: こちらのサイトからチャンネルIDを調べてください。
th: ตรวจสอบ ID ของแชนแนลได้ที่นี่

# home_title_channel_list
source: List of Thai VTuber channels
ja: タイのVTuberチャンネル一覧
th: ลิสต์แชนแนล VTuber ไทย

# home_title_video_list
source: List of Thai VTuber videos
ja: タイのVTuber動画一覧
th: ลิสต์วิดีโอ VTuber ไทย

# home_tab_channel
source: Channels
ja: チャンネル
th: แชนแนล

# home_tab_video
source: Videos
ja: 動画
th: วิดีโอ

# home_tooltip_add_channel
source: Submit new VTuber channel
ja: チャンネル掲載申請
th: แจ้งเพิ่มแชนแนล

# navigation_menu_text_channel_type
source: Channel Type
ja: チャンネルカテゴリ
th: ประเภทแชนแนล

# navigation_menu_text_original_description
source: Original VTuber' refers to a channel that debuted and has been creating content as a VTuber from the beginning, rather than transitioning from other types of content.
ja: 「オリジナルVTuber」は、チャンネル開設時からVTuberとしてデビューし、コンテンツを制作しているチャンネルを指します。
th: 'VTuber เต็มตัว' หมายถึงแชนแนลที่เดบิวต์ตัวเองเป็น VTuber และทำคอนเทนต์ VTuber ตั้งแต่ต้น ไม่ได้เปลี่ยนมาจากคอนเทนต์อื่น

# navigation_menu_text_active_type
source: Activity Type
ja: アクティブ状態
th: ประเภทการอัปเดต

# navigation_menu_text_active_type_explanation
source: Channels that have not uploaded a video for over 90 days are classified as inactive.
ja: 90日以上動画を投稿していないチャンネルは非アクティブチャンネルとなります。
th: แชนแนลที่ไม่มีการอัปโหลดวิดีโอมา 90 วันขึ้นไป จัดเป็นแชนแนลที่ไม่มีการอัปเดต

# navigation_menu_radio_box_active_only
source: Active channels
ja: アクティブ
th: แชนแนลที่ยังอัปเดตอยู่

# navigation_menu_radio_box_active_and_inactive
source: Active and inactive channels
ja: アクティブおよび非アクティブ
th: แชนแนลที่อัปเดตและไม่อัปเดต

# home_tooltip_display_only_channel
source: Displaying only {channelActivityType}
ja: {channelActivityType} のみを表示中
th: กำลังแสดงเฉพาะ {channelActivityType}

# home_tooltip_display_channel
source: Displaying {channelActivityType}
ja: {channelActivityType} を表示中
th: กำลังแสดง {channelActivityType}

# search_bar_placeholder
source: Search for channel
ja: チャンネル検索
th: ค้นหาแชนแนล

# search_text_input_prompt
source: Enter the name of the channel
ja: チャンネル名を入力
th: พิมพ์ชื่อแชนแนลที่อยากค้นหา

# search_text_not_found
source: No results found
ja: 結果が見つかりません
th: ไม่พบผลลัพธ์

# channel_list_text_subscribers
source: {subscribers} subscribers
ja: フォロワー {subscribers} 人
th: ผู้ติดตาม {subscribers} คน

# channel_list_text_views
source: {views} views
ja: 視聴 {views} 回
th: ดู {views} ครั้ง

# channel_list_text_updated_published
source: Latest video {updated} Channel opened on {published}
ja: 動画更新日 {updated} チャンネル開設日 {published}
th: วิดีโอล่าสุด {updated} วันเปิดแชนแนล {published}

# video_list_text_not_found
source: No videos
ja: 動画がありません
th: ไม่มีวิดีโอ

# video_list_text_live_start
source: Scheduled {liveStart}
ja: ライブ開始 {liveStart}
th: เริ่ม {liveStart}

# video_list_text_concurrent_view
source: Concurrent View: {concurrentView} people
ja: 同時視聴 {concurrentView} 人
th: ดูพร้อมกัน {concurrentView} คน

# video_list_text_views_published
source: {views} views | {publishedAt}
ja: {views}回 | {publishedAt}
th: ดู {views} ครั้ง | {publishedAt}

# channel_list_tab_subscribers
source: Subscribers
ja: フォロワー
th: ผู้ติดตาม

# channel_list_tab_views
source: Views
ja: 視聴

# channel_list_tab_published
source: Published
ja: 開設日
th: วันเปิดแชนแนล

# channel_list_text_rank
source: Rank {displayRank} {title}
ja: {displayRank}位 {title}
th: อันดับ {displayRank} {title}

# video_list_tab_live
source: Live
ja: ライブ

# video_list_tab_one_day
source: 24 hours
ja: 24時間
th: 24 ชม.

# video_list_tab_three_days
source: 3 days
ja: 3日
th: 3 วัน

# video_list_tab_seven_days
source: 7 days
ja: 7日
th: 7 วัน

# error_empty_channel_description
source: Unable to display information. Please check your internet connection, or notify the developer to correct the issue
ja: エラーが発生しました。 インターネットが正常に接続されているかを確認し、 開発者に連絡してください。
th: เกิดข้อผิดพลาดจึงไม่สามารถแสดงข้อมูลได้ กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ต หรือแจ้งผู้พัฒนาเพื่อทำการแก้ไข

# error_empty_channel_contact
source: Contact @chuymaster
ja: @chuymaster に連絡
th: ติดต่อ @chuymaster

# error_not_found_description
source: Page not found ({route}). Please check the URL again.
ja: {route}が存在しません。URLをもう一度確認してください。
th: ไม่พบเพจที่ต้องการเปิด ({route}). โปรดตรวจสอบ URL อีกครั้ง

# error_not_found_title
source: Not Found
ja: 存在しないページです
